; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v2 ?v8)
             (pred_1 ?v5 ?v13)
             (pred_12 ?v2 ?v13)
             (pred_3 ?v11 ?v2 )
	     (pred_10 ?v2)
             (pred_4 ?v3)
             (pred_11 ?v5)
             (pred_9 ?v13)
             (pred_8 ?v2)
             (pred_7 ?v5)
             (pred_2 ?v2)
             (pred_6 ))



(:action op_1
:parameters (?v6 ?v12 ?v7 ?v10)
:precondition (and (pred_4 ?v6) (pred_4 ?v12) (pred_11 ?v7) (pred_9 ?v10)
          (pred_5 ?v6 ?v12) (pred_1 ?v7 ?v10)
                   (pred_12 ?v12 ?v10) (pred_10 ?v6) 
                   (pred_8 ?v12) (pred_7 ?v7))
:effect (and  (pred_2 ?v12) (not (pred_8 ?v12))))


(:action op_2
:parameters (?v6 ?v1)
:precondition (and (pred_4 ?v6) (pred_4 ?v1)
               (pred_10 ?v6) (pred_5 ?v6 ?v1) (pred_2 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v6))))

(:action op_5
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_11 ?v7) 
                  (pred_10 ?v6) (pred_3 ?v7 ?v6) (pred_6 ))
:effect (and (pred_7 ?v7)
   (not (pred_3 ?v7 ?v6)) (not (pred_6 ))))


(:action op_4
:parameters (?v6 ?v4 ?v9)
:precondition (and (pred_4 ?v6) (pred_11 ?v4) (pred_11 ?v9)
                  (pred_10 ?v6) (pred_7 ?v9) (pred_3 ?v4 ?v6))
:effect (and (pred_7 ?v4) (pred_3 ?v9 ?v6)
        (not (pred_7 ?v9)) (not (pred_3 ?v4 ?v6))))

(:action op_3
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_11 ?v7) 
                  (pred_10 ?v6) (pred_7 ?v7))
:effect (and (pred_6 ) (pred_3 ?v7 ?v6) (not (pred_7 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_17 obj_21 obj_12 obj_11 obj_20 obj_10 obj_07 obj_27 obj_22 obj_13 obj_24 obj_29 obj_14 obj_30 obj_19 obj_31 obj_25 obj_06 obj_28 obj_02 obj_01 obj_15 obj_03 obj_16
    obj_09 obj_26 obj_08
    obj_23 obj_05 obj_18
    )

    (:init
       (pred_6)

       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_21)
       (pred_4 obj_12)
       (pred_4 obj_11)
       (pred_4 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_22)
       (pred_4 obj_13)
       (pred_4 obj_24)
       (pred_4 obj_29)
       (pred_4 obj_14)
       (pred_4 obj_30)
       (pred_4 obj_19)
       (pred_4 obj_31)
       (pred_4 obj_25)
       (pred_4 obj_06)
       (pred_4 obj_28)
       (pred_4 obj_02)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_03)
       (pred_4 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_26)
       (pred_9 obj_08)
       (pred_11 obj_23)
       (pred_11 obj_05)
       (pred_11 obj_18)

       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_17 obj_21)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_21 obj_07)
       (pred_5 obj_21 obj_12)
       (pred_5 obj_21 obj_17)
       (pred_5 obj_12 obj_27)
       (pred_5 obj_12 obj_11)
       (pred_5 obj_12 obj_21)
       (pred_5 obj_11 obj_22)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_10 obj_24)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_07 obj_29)
       (pred_5 obj_07 obj_27)
       (pred_5 obj_07 obj_21)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_27 obj_14)
       (pred_5 obj_27 obj_22)
       (pred_5 obj_27 obj_12)
       (pred_5 obj_27 obj_07)
       (pred_5 obj_22 obj_30)
       (pred_5 obj_22 obj_11)
       (pred_5 obj_22 obj_27)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_24)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_24 obj_31)
       (pred_5 obj_24 obj_29)
       (pred_5 obj_24 obj_10)
       (pred_5 obj_24 obj_13)
       (pred_5 obj_29 obj_25)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_29 obj_07)
       (pred_5 obj_29 obj_24)
       (pred_5 obj_14 obj_06)
       (pred_5 obj_14 obj_30)
       (pred_5 obj_14 obj_27)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_30 obj_28)
       (pred_5 obj_30 obj_22)
       (pred_5 obj_30 obj_14)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_31)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_31 obj_01)
       (pred_5 obj_31 obj_25)
       (pred_5 obj_31 obj_24)
       (pred_5 obj_31 obj_19)
       (pred_5 obj_25 obj_15)
       (pred_5 obj_25 obj_06)
       (pred_5 obj_25 obj_29)
       (pred_5 obj_25 obj_31)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_06 obj_28)
       (pred_5 obj_06 obj_14)
       (pred_5 obj_06 obj_25)
       (pred_5 obj_28 obj_16)
       (pred_5 obj_28 obj_30)
       (pred_5 obj_28 obj_06)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_31)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_25)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_03 obj_16)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_16 obj_28)
       (pred_5 obj_16 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_30)
       (pred_12  obj_04 obj_09)
       (pred_12  obj_11 obj_26)
       (pred_12  obj_30 obj_08)
       (pred_2 obj_17)
       (pred_2 obj_21)
       (pred_2 obj_12)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_27)
       (pred_2 obj_22)
       (pred_2 obj_13)
       (pred_2 obj_24)
       (pred_2 obj_29)
       (pred_2 obj_14)
       (pred_2 obj_19)
       (pred_2 obj_31)
       (pred_2 obj_25)
       (pred_2 obj_06)
       (pred_2 obj_28)
       (pred_2 obj_02)
       (pred_2 obj_01)
       (pred_2 obj_15)
       (pred_2 obj_03)
       (pred_2 obj_16)

       (pred_1  obj_23 obj_09)
       (pred_1  obj_05 obj_26)
       (pred_1  obj_18 obj_08)
       (pred_3 obj_23 obj_03)
       (pred_3 obj_05 obj_20)
       (pred_3 obj_18 obj_12)
       (pred_10 obj_17)
    )

    (:goal (and
       (pred_3 obj_23 obj_07)
       (pred_3 obj_18 obj_19)
    ))
(:constraints
  (always (not (pred_10 obj_06)))
)
)

; plan
1. (op_2 obj_17 obj_10)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_10)
   goals met: 0 of 2
2. (op_2 obj_10 obj_07)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_07)
   goals met: 0 of 2
3. (op_2 obj_07 obj_29)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_29)
   goals met: 0 of 2
4. (op_2 obj_29 obj_25)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_25)
   goals met: 0 of 2
5. (op_2 obj_25 obj_15)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_15)
   goals met: 0 of 2
6. (op_2 obj_15 obj_03)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_03)
   goals met: 0 of 2
7. (op_5 obj_03 obj_23)
   deleted: (pred_3 obj_23 obj_03) (pred_6)
   added: (pred_7 obj_23)
   goals met: 0 of 2
8. (op_2 obj_03 obj_15)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_15)
   goals met: 0 of 2
9. (op_2 obj_15 obj_25)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_25)
   goals met: 0 of 2
10. (op_2 obj_25 obj_29)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_29)
   goals met: 0 of 2
11. (op_2 obj_29 obj_07)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_07)
   goals met: 0 of 2
12. (op_3 obj_07 obj_23)
   deleted: (pred_7 obj_23)
   added: (pred_6) (pred_3 obj_23 obj_07)
   goals met: 1 of 2
13. (op_2 obj_07 obj_21)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_21)
   goals met: 1 of 2
14. (op_2 obj_21 obj_12)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_12)
   goals met: 1 of 2
15. (op_5 obj_12 obj_18)
   deleted: (pred_3 obj_18 obj_12) (pred_6)
   added: (pred_7 obj_18)
   goals met: 1 of 2
16. (op_2 obj_12 obj_21)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_21)
   goals met: 1 of 2
17. (op_2 obj_21 obj_17)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_17)
   goals met: 1 of 2
18. (op_2 obj_17 obj_10)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_10)
   goals met: 1 of 2
19. (op_2 obj_10 obj_20)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_20)
   goals met: 1 of 2
20. (op_2 obj_20 obj_13)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_13)
   goals met: 1 of 2
21. (op_2 obj_13 obj_19)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_19)
   goals met: 1 of 2
22. (op_3 obj_19 obj_18)
   deleted: (pred_7 obj_18)
   added: (pred_6) (pred_3 obj_18 obj_19)
   goals met: 2 of 2
